鐵達尼號乘客生存預測:(

前言

匯入資料
安裝：
! pip3 install mysql-connector-python-rf 
匯入：
import mysql.connector

In [139]:
import mysql.connector
import pandas as pd
import numpy as py
import matplotlib.pyplot as plt


cnx = mysql.connector.connect(user = 'root', password = 'xu3xjp4j4xu3',
                              host = '127.0.0.1',
                              database = 'titanic')
cur = cnx.cursor()
#cur.execute("SELECT PassengerId, Survived, Pclass, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked FROM train")
cur.execute("SELECT PassengerId, Survived, Pclass, Age, SibSp, Parch, Fare FROM train")
#cur.execute("SELECT PassengerId FROM train")
tata_tra_row = cur.fetchall()
#type(tata_tra_row)
#print(tata_tra_row)
tata_tra_df = pd.DataFrame(tata_tra_row)
#print(tata_tra_df)
#type(tata_tra_df)
#tata_tra_df.head()

cnx.close()

變數意義

In [103]:
tata_tra_df.replace('', 'null')

In [123]:
tata_tra_df.describe().T

  count unique   top freq
0   891    891   831    1
1   891      2     0  549
2   891      3     3  491
3   891     89        177
4   891      7     0  608
5   891      7     0  678
6   891    248  8.05   43

In [130]:
tata_tra_df[tata_tra_df.isnull()]
tata_tra_df.columns

RangeIndex(start=0, stop=7, step=1)

問題：
1.連進來顯示不了表頭
2.無法做完整敘述統計
3.抓不出NULL值

In [113]:
#非連進來的data皆可以成功做#
a = [0,1, ]
a = pd.DataFrame(a)
a.isnull()
a.describe()
#非連進來的data皆可以成功做#